app/graphql/types/query_type.rb

    def get_course(id:)
      Course.find(id)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]